Amiya200/stm32_water_tank/Core/Src/screen.c
    /* Countdown quick-stop */
    if (ui == UI_COUNTDOWN && b == BTN_DOWN)
    { ModelHandle_StopCountdown(); ui = UI_DASH; screenNeedsRefresh = true; return; }

    /* ── RESET button: back navigation ────────────────────────────── */
    if (b == BTN_RESET)
    {
        if (ui == UI_DASH)
        {
            if (!ModelHandle_IsRestartActive()) ModelHandle_StartRestart();
            else                                ModelHandle_StopRestart();
            dash_page = 0; dash_cycle_start = HAL_GetTick(); screenNeedsRefresh = true; return;
        }
        else
        {
            /* Cancel pairing if active */
            if (ui == UI_ADD_DEVICE_PAIR && pairingInProgress)
            { pairingInProgress = false; LoRa_ExitPairingMode(); }

            switch (ui)
            {
                case UI_SETTINGS_GAP: case UI_SETTINGS_RETRY: case UI_SETTINGS_UV:
                case UI_SETTINGS_OV:  case UI_SETTINGS_OL:    case UI_SETTINGS_UL:
                case UI_SETTINGS_MAXRUN: case UI_SETTINGS_PWRREST: case UI_SETTINGS_FACTORY:
                case UI_DEVSET_EDIT_DATE: case UI_DEVSET_EDIT_TIME: case UI_DEVSET_EDIT_DAY:
                    ui = UI_DEVSET_MENU; break;
                case UI_DEVSET_MENU:
                case UI_ADD_DEVICE_MENU:
                case UI_ADD_DEVICE_PAIR:
                case UI_ADD_DEVICE_REMOVE:
                case UI_ADD_DEVICE_PAIR_DONE:
                case UI_ADD_DEVICE_REMOVE_DONE:
                    ui = UI_MENU; break;
                case UI_COUNTDOWN_EDIT_MIN: ui = UI_COUNTDOWN; break;
                case UI_COUNTDOWN: ModelHandle_StopCountdown(); ui = UI_DASH; break;
                default: ui = UI_DASH; break;
            }
        }
        screenNeedsRefresh = true; return;
    }

    /* ── Reset-to-default confirm ─────────────────────────────────── */
    if (ui == UI_RESET_CONFIRM)
    {
        if (b == BTN_UP || b == BTN_DOWN) reset_confirm_yes = !reset_confirm_yes;
        else if (b == BTN_SELECT)
        {
            if (reset_confirm_yes)
            {
                ModelHandle_FactoryReset();
                edit_settings_dry_en  = ModelHandle_GetDryRunEnable() ? 1 : 0;
                edit_settings_gap_s   = ModelHandle_GetGapTime() / 60;
                edit_settings_retry   = ModelHandle_GetDryRunRetryGap() / 60;
                edit_settings_uv      = ModelHandle_GetUnderVolt();
                edit_settings_ov      = ModelHandle_GetOverVolt();
                edit_settings_maxrun  = ModelHandle_GetMaxRunTime();
                edit_settings_ol      = (int)ModelHandle_GetOverloadLimit();
                edit_settings_ul      = (int)ModelHandle_GetUnderloadLimit();
                edit_settings_pwrrest = ModelHandle_GetPowerRestoreMode();
                clear_sticky_mode_flags();
            }
            ui = UI_DASH;
        }
        screenNeedsRefresh = true; return;
    }

    /* ── DASH shortcuts ───────────────────────────────────────────── */
    if (ui == UI_DASH)
    {
        switch (b)
        {
            case BTN_RESET_LONG: ModelHandle_ToggleManual(); break;
            case BTN_SELECT:
                if (!autoActive) ModelHandle_StartAuto(edit_auto_gap_s, edit_auto_maxrun_min, edit_auto_retry);
                else             ModelHandle_StopAuto(); break;
            case BTN_SELECT_LONG:
                ui = UI_MENU; menu_idx = 0; menu_view_top = 0; screenNeedsRefresh = true; return;
            case BTN_UP:
                if (autoActive) { if (!timerActive) ModelHandle_Button3_SinglePress(); else ModelHandle_StopTimer(); }
                screenNeedsRefresh = true; break;
            case BTN_UP_LONG:
                if (!semiAutoActive) { ModelHandle_StartSemiAuto(); sticky_set_semi(); }
                else                   ModelHandle_StopSemiAuto();
                screenNeedsRefresh = true; break;
            case BTN_DOWN:
                if (!countdownActive)
                { ModelHandle_StartCountdown(edit_countdown_min * 60); countdownActive = true; sticky_set_countdown(); ui = UI_COUNTDOWN; }
                else
                { ModelHandle_StopCountdown(); countdownActive = false; ui = UI_DASH; }
                screenNeedsRefresh = true; return;
            case BTN_DOWN_LONG:
                if (!countdownActive) { ui = UI_COUNTDOWN_EDIT_MIN; edit_countdown_min = 1; screenNeedsRefresh = true; } break;
            default: break;
        }
        return;
    }

    /* ── Main menu ────────────────────────────────────────────────── */
    if (ui == UI_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG) menu_select();
        else if (b == BTN_DOWN && menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
        else if (b == BTN_UP   && menu_idx > 0)                   menu_idx--;
        screenNeedsRefresh = true; return;
    }

    /* ── Device setup menu ────────────────────────────────────────── */
    if (ui == UI_DEVSET_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG) menu_select();
        else if (b == BTN_DOWN && devset_idx < DEVSET_MENU_COUNT - 1) devset_idx++;
        else if (b == BTN_UP   && devset_idx > 0)                     devset_idx--;
        screenNeedsRefresh = true; return;
    }

    /* ── ADD DEVICE: menu navigation (Pair / Remove) ─────────────── */
    if (ui == UI_ADD_DEVICE_MENU)
    {
        if (b == BTN_UP   && addDevMenuIndex > 0) addDevMenuIndex--;
        if (b == BTN_DOWN && addDevMenuIndex < 1) addDevMenuIndex++;
        if (b == BTN_SELECT)
        {
            if (addDevMenuIndex == 0)
            {
                pairingInProgress = false; pairingComplete = false; pairingTimedOut = false;
                addDevTypeIndex = 0;
                ui = UI_ADD_DEVICE_PAIR;
            }
            else
            {
                addDevTypeIndex = 0;
                ui = UI_ADD_DEVICE_REMOVE;
            }
        }
        screenNeedsRefresh = true; return;
    }

    /* ── ADD DEVICE: pair screen ──────────────────────────────────── */
    if (ui == UI_ADD_DEVICE_PAIR)
    {
        if (b == BTN_SELECT)
        {
            if (pairingComplete || pairingTimedOut)
            {
                /* Acknowledge result — go back */
                pairingInProgress = false; pairingComplete = false; pairingTimedOut = false;
                LoRa_ExitPairingMode();
                ui = UI_ADD_DEVICE_MENU;
            }
            else if (!pairingInProgress)
            {
                if (PairedDev_Count() >= MAX_PAIRED)
                {
                    /* List full — display message, do nothing */
                    /* show_add_device_pair() will show "Full Remove1st>" */
                }
                else
                {
                    LoRa_EnterPairingMode();
                    pairingInProgress = true;
                    pairingComplete   = false;
                    pairingTimedOut   = false;
                    pairingStartTime  = HAL_GetTick();
                }
            }
            else
            {
                /* SELECT while waiting → cancel pairing */
                pairingInProgress = false;
                LoRa_ExitPairingMode();
            }
        }
        screenNeedsRefresh = true; return;
    }

    /* ── ADD DEVICE: remove screen ───────────────────────────────── */
    if (ui == UI_ADD_DEVICE_REMOVE)
    {
        uint8_t cnt = PairedDev_Count();
        if ((b == BTN_UP || b == BTN_DOWN) && cnt > 0)
            addDevTypeIndex = (uint8_t)((addDevTypeIndex + 1) % cnt);
        else if (b == BTN_SELECT)
        {
            if (cnt > 0)
            {
                PairedDev_Remove(PairedDev_Get(addDevTypeIndex % cnt));
                addDevTypeIndex     = 0;
                pairingDoneDispTime = HAL_GetTick();
                ui = UI_ADD_DEVICE_REMOVE_DONE;
            }
            else { ui = UI_ADD_DEVICE_MENU; }
        }
        screenNeedsRefresh = true; return;
    }

